Repository: Saadt33/vervebridge-CMS
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: az

source: Compilation succeeded
az: Uğurlu kompilyasiya

source: Your submission successfully compiled to an executable.
az: Sizin yükləməniz uğurla işlək proqrama çevrildi.

source: Compilation failed
az: Kompilyasiya səhvi

source: Your submission did not compile correctly.
az: Sizin teqdiminiz duzgun kompilyasiya olunmur

source: Compilation timed out
az: Kompilyasiya ayrılmış vaxt limiti aşıb

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
az: sizin teqdim kompilyasiya zamanı vaxt limitini keçmişdir. Bu artıq işledilmiş C++ şablonundan neticelene biler.

source: Output is correct
az: Netice düzgündür

source: Your submission ran and gave the correct answer
az: Sizin həll işledi ve düzgün cavab verdi

source: Your submission ran and gave the partially correct answer
az: Sizin həll işlədi ve qismən düzgün cavab verdi

source: Output isn't correct
az: Nəticə düzgün deyil

source: Your submission ran, but gave the wrong answer
az: Sizin həll işledi ve yanlış cavab verdi

source: Evaluation didn't produce file %s
az: Yoxlama %s faylını yarada bilmədi

source: Your submission ran, but did not write on the correct output file
az: Sizin həll işlədi lakin düzgün nəticə faylinda yazılmadı

source: Execution timed out
az: İcraya ayrılan limit aşıb

source: Your submission used too much CPU time.
az: Sizin teqdim heddinden artıq CPU vaxtı işledib

source: Execution timed out (wall clock limit exceeded)
az: İcra dayandırılmışdır (divar saatı limiti icra edildi

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
az: Sizin həll həddindən artıq zaman istifadə edib. Bu yanlış kodlaşdırma, buferin dolması kimi səbələrdən ola bilər. Nəzərə alın ki, bu halda həllin təfərrüatlarında göstərilən CPU zamanı işləmə zamanından kiçik ola bilər.

source: Execution killed with signal %s (could be triggered by violating memory limits)
az: İcra %s siqnalı ilə dayandırılmışdır (yaddaş limiti ilə bağlı ola bilər)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
az: İcra məcburi şəkildə dayandırılmışdır. Bu ifrat yaddaş istifadəsi ilə bağlı ola bilər.

source: Execution failed because the return code was nonzero
az: Cavab kodu sıfırdan fərqli olduğu üçün icra səhvi qeydə alındı

source: Your submission failed because it exited with a return code different from 0.
az: Sizin təqdim 0-dan fərqli kod qaytardığı üçün uğursuzdur

source: N/A
az: məlumat yoxdur

source: Score details temporarily unavailable.
az: Hesab detalları müvəqqəti olaraq əlçatan deyildir.

source: Subtask %(index)s
az: Altməsələ %(index)s

source: Outcome
az: Nəticə

source: Details
az: Təfərrüatlar

source: Execution time
az: İcra vaxtı

source: Memory used
az: Yaddaş istifadəsi

source: Not correct
az: Düzgün deyil

source: Correct
az: Düzgün

source: Partially correct
az: Qismən düzgün

source: Invalid files in submission
az: Teqdimde yanlış fayl

source: Execution completed successfully
az: İcra müvəffəqiyyətlə başa çatıb

source: No compilation needed
az: Kompilyasiyaya ehtiyac yoxdur

source: File not submitted
az: Fayl yuklənməyib

source: loading...
az: yuklenir...

source: unknown
az: naməlum

source: contest-token
az: müsabiqə-açar

source: contest-tokens
az: müsabiqə-açarları

source: task-token
az: tapşırıq-açar

source: task-tokens
az: tapşırıq-açarları

source: token
az: açar

source: tokens
az: açarlar

source: You don't have %(type_pl)s available for this task.
az: Sizin bu tapşırıq üçün uyğun %(type_pl)s yoxdur.

source: You have an infinite number of %(type_pl)s for this task.
az: Для этой задачи у вас неограниченное количество %(type_pl)s.

source: You start with no %(type_pl)s.
az: Вы начинаете без %(type_pl)s.

source: You start with one %(type_s)s.
az: Siz %(type_s)s ilə başlayırsınız.

source: Every minute
az: Hər dəqiqə

source: you get another %(type_s)s,
az: siz daha bir %(type_s)s alırsınız,

source: up to a maximum of one %(type_s)s.
az: maksimum bir %(type_s)s

source: you get another %(type_s)s.
az: siz əlavə %(type_s)s alırsınız.

source: You don't get other %(type_pl)s.
az: Sizdə artıq %(type_pl)s yoxdur.

source: You can use a %(type_s)s every second
az: Siz hər saniiyədə bir %(type_s)s istifadə edə bilərsiniz

source: and no more than one %(type_s)s in total.
az: və maksimum bir %(type_s)s

source: You can use a %(type_s)s every second.
az: Siz hər saniyədə bir %(type_s)s istifadə edə bilərsiniz

source: You can use no more than one %(type_s)s in total.
az: Siz cəmi bir %(type_s)s istifadə edə bilərsiniz.

source: You have reached the question length limit.
az: Siz sual ölçü limitinə çatdınız

source: Question received
az: Sual qəbul edildi

source: Your question has been received, you will be notified when it is answered.
az: Sizin sual qəbul edildi ve siz cavablandıqda bildiriş alacaqsınız.

source: Please select the correct files.
az: Zəhmət olmasa düzgün faylı seçin.

source: Please try again.
az: Zəhmət olmasa yeniden cəhd edin.

source: Your print job has been received.
az: Sizin çap işiniz əldə edildi

source: You have reached the maximum limit of at most %d submissions among all tasks.
az: Siz butun tapşırıqlar boyunca maksimum teqdim limitinə çatmısınız %d.

source: You have reached the maximum limit of at most %d submissions on this task.
az: Siz bu tapşırıqda maksimum teqdim limitinə çatmısınız %d.

source: Too many submissions!
az: Çoxlu teqdim!

source: Among all tasks, you can submit again after %d seconds from last submission.
az: Butun tapşırıqlar arasında axırıncı təqdim etdiyinizden dərhal sonra siz yenidən təqdim edə bilərsiniz.

source: For this task, you can submit again after %d seconds from last submission.
az: Bu tapşırığı, axırıncı yükləmədən %d saniyə sonra yenidən yükləyə bilərsiniz.

source: Submissions too frequent!
az: Yükləmələr çox tez-tez baş verir!

source: Invalid submission format!
az: Yüklənilən fayl yanlış formatdadır!

source: Invalid archive format!
az: Yanlış formatda arxiv faylı!

source: The submitted archive could not be opened.
az: Göndərilən arxiv fayl açıla bilmir.

source: Language %s not allowed in this contest.
az: %s dili yarışmada icazə verilmir.

source: Invalid submission!
az: Yanlış yükləmə!

source: Submission too big!
az: Yüklənilən faylın həcmi çox böyükdür!

source: Each source file must be at most %d bytes long.
az: Hər bir mənbə faylı maksimum %d bayt uzunluğunda olmalıdır.

source: Submission storage failed!
az: Fayl yaddaşa yazılmadı!

source: Submission received
az: Fayl qəbul olundu

source: Your submission has been received and is currently being evaluated.
az: Yükləməniz qəbul olundu və hal hazırda qiymətləndirmə mərhəsindədir.

source: Compiling...
az: Emal olunur...

source: details
az: Detallar

source: Evaluating...
az: Qiymətləndirilir...

source: Scoring...
az: Xallar verilir...

source: Evaluated
az: Qiymətləndirildi

source: Token request discarded
az: Açar müraciəti ləğv edildi

source: Your request has been discarded because you have no tokens available.
az: Sizin müraciət ləğv olundu çünki, sizdə kifayət qədər açar yoxdur

source: Your request has been discarded because you already used a token on that submission.
az: Sizin müraciət qəbul edilmədi, çünki siz artıq açarı istifadə etmisiniz.

source: Token request received
az: Açar müraciəti qəbul olundu.

source: Your request has been received and applied to the submission.
az: Sizin müraciət qəbul olundu və yüklənmə üçün təqdim edildi.

source: You have reached the maximum limit of at most %d tests among all tasks.
az: Siz bütün tapşırıqlar arasında maximum %d test sayına çatmısınız.

source: You have reached the maximum limit of at most %d tests on this task.
az: Siz maximum %d test sayına çatmısınız.

source: Too many tests!
az: Həddindən çox testlər!

source: Among all tasks, you can test again after %d seconds from last test.
az: Bütün tapşırıqlar arasından yenidən test etməyi axırıncı testdən %d saniyə sonra edə bilərsiniz.

source: For this task, you can test again after %d seconds from last test.
az: Bu tapşırıq üçün, yenidən test etməyi axırıncı testdən %d saniyə sonra edə bilərsiniz.

source: Tests too frequent!
az: Testlər tez-tez baş verir!

source: Invalid test format!
az: Yanlış test formatı!

source: Invalid test!
az: Yanlış test!

source: Test too big!
az: Testin həcmi çox böyükdür!

source: Input too big!
az: Daxil edilən fayl çox böyükdür!

source: The input file must be at most %d bytes long.
az: Daxil edilən fayl ən azı %d bayt olmalıdır.

source: Test storage failed!
az: Testin yaddaşa yazılmasında səhv baş verdi!

source: Test received
az: Test qəbul olundu

source: Your test has been received and is currently being executed.
az: Sizin test qəbul olundu və hal-hazırda icra olunur.

source: Executing...
az: İcra olunur...

source: Executed
az: İcra olundu

source: Communication
az: Kommunikasiya

source: Announcements
az: Elanlar

source: (no subject)
az: (mövzsuz)

source: Questions
az: Suallar

source: Subject
az: Mövzu

source: Text
az: Tekst

source: Ask question
az: Sual soruş

source: Reset
az: Təmizlə

source: no answer yet
az: Hələlik cavab yoxdur.

source: Messages
az: Mesajlar

source: Automatic (%(lang)s)
az: Avtomatik (%(lang)s)

source: Logout
az: Çıxış

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
az: Daxil oldu <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Failed to log in.
az: Daxil oluna bilinmədi.

source: Welcome
az: Xoş gəlmişsiniz

source: Please log in
az: Zəhmət olmasa daxil olun

source: Username
az: İstifadəçi adı

source: Password
az: Şifrə

source: Login
az: Daxil ol

source: New message
az: Yeni ismarıc

source: New announcement
az: Yeni elan

source: New answer
az: Yeni cavab

source: %d unread
az: %d oxunmamış

source: Until contest starts:
az: Yarışın başlanmasına:

source: Until contest ends:
az: Yarışın sonuna:

source: Time left:
az: Qalmiş vaxt:

source: Server time:
az: Server vaxtı:

source: Overview
az: Baxış

source: Statement
az: Məsələnin şərti

source: Submissions
az: Məsələnin həlli

source: Documentation
az: Sənədlər

source: Testing
az: Yoxlama

source: Printing
az: Çap etmə

source: Programming languages and libraries
az: Proqramlaşdırma dillləri və kitabxanaları

source: Explanation
az: İzah

source: Error %(status_code)s
az: Xəta %(status_code)s

source: An error occured while the server was handling your request.
az: Emal zamanı xəta baş verdi.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
az: Nəzərə alın ki, sistəmə müdaxilə etmək cəhdləri köçürmə kimi qiymətləndrilə bilər və bu səbəbdən diskvalifikasiya oluna bilərsiniz.

source: If you encountered this error during normal usage, please notify the contest administrators.
az: Əgər normal istifadə zamanı bu səhvlə qarşılaşsanızç zəhmət olmasa administratorlara bildirin

source: General information
az: Ümumi məlumat

source: The contest hasn't started yet.
az: Yarış hələ başlamayıb.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
az: Yarışın başlama vaxtı %(start_time)s, bitmə vaxtı isə %(stop_time)s.

source: The contest is currently running.
az: Yarış gedir.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
az: Yarışın başlama vaxtı %(start_time)s və bitmə vaxtı %(stop_time)s.

source: The contest has already ended.
az: Yarış artıq bitmişdir.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
az: Yarış başlama vaxtı %(start_time)s və bitmə vaxtı в %(stop_time)s.

source: You have an infinite number of tokens.
az: Sizin sonsuz sayda açarlarınız var.

source: You can see the detailed result of a submission by using a token on it.
az: Açar istifadə edərək siz detallı teqdim neticələrini gorə bilersiniz

source: Your score for each task will be the maximum among the tokened submissions and the last one.
az: Açarla göndərilmiş yukləmələr arasında hər bir tapşırıq üçün sizin hesabınız maksimum olacaqdır

source: You have a distinct set of tokens for each task.
az: Sizin hər bir tapşırıq üçün fərqli açar toplusu var.

source: You can find the rules for the %(type_pl)s on each task's description page.
az: Siz hər bir %(type_pl)s üçün qayda ilə müvafiq tapşırığın səhifəsində tanış ola bilərsiniz.

source: You have a set of tokens shared among all tasks.
az: Paylaşılan tapşırıqlar boyunca sizin açarlar dəstiniz var.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
az: Sizin iki növ açar mövcuddur: bütün tapşırıqlar üçün <em>contest-token</em> toplusu, və hər bir tapşırıq üçün olan <em>task-token</em>.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
az: Siz yukləmələrin detallı nəticələrini iki açarı istifadə edərək gorə bilersiniz

source: You can submit at most %(user_tests)s user tests during this contest.
az: Siz yarış müddətində en çoxu %(user_tests)s admin testləri yukləyə bilərsiniz

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
az: Hər bir iştirakçı %(per_user_time)s zaman ərzində öz həllərini göndərə bilər.

source: As soon as the contest starts you can choose to start your time frame.
az: Yarış başladıqda siz öz vaxt limitinizi seçə bilərsiniz.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
az: Yarış başladıqdan sonra siz həllərinizi vaxt limitinin və ya yarış vaxtı bitənə qədər göndərə bilərsniz.

source: By clicking on the button below you can start your time frame.
az: Siz düyməyə basmaqla vaxt limitinizə başlaya bilərsiniz.

source: You started your time frame at %(start_time)s.
az: Siz vaxt limitinizə %(start_time)s də başladınız.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
az: Siz həllərinizi vaxt limitinin və ya yarış vaxtı bitənə qədər göndərə bilərsniz.

source: You started your time frame at %(start_time)s and you already finished it.
az: siz vaxt limitinə başladınız %(start_time)s və artıq bitirdiniz.

source: There's nothing you can do now.
az: Sizin edə biləcəyiniz heçnə yoxdur.

source: You never started your time frame. Now it's too late.
az: Siz heç vaxt vaxt limitinizə başlamadınız. İndi isə çox gecdir

source: Start!
az: Başla!

source: Task overview
az: Tapşırığa ümumi baxış

source: Task
az: Tapşırıq

source: Name
az: Ad

source: Time limit
az: Vaxt limiti

source: Memory limit
az: Yaddaş limiti

source: Type
az: Növ

source: Files
az: Fayllar

source: Tokens
az: Açarlar

source: Yes
az: Bəli

source: No
az: Xeyr

source: Print
az: Çap Et

source: You can print %(remaining_jobs)s more text or PDF files of up to %(max_pages)s pages each.
az: Siz daha çox metn və yaxud PDF faylları çap ede %(remaining_jobs)s bilərsiniz - maksimum %(max_pages)s səhifə.

source: You can print %(remaining_jobs)s more text files of up to %(max_pages)s pages each.
az: Siz səhifə sayı maksimum %(max_pages)s olan %(remaining_jobs)s sənəd çap edə bilərsiniz.

source: File (text or PDF)
az: Fayl (mətn və ya PDF)

source: File (text)
az: Fayl (məzmun)

source: Submit
az: Göndər

source: You cannot print anything any more as you have used up your printing quota.
az: Siz çap etmə normasına qədər istifadə etdiyiniz heçnəyi artıq çap edə bilməzsiniz

source: Date and time
az: Tarix və vaxt

source: Time
az: Vaxt

source: File name
az: Faylın adı

source: Compilation output
az: Kompilyasiya nəticəsi

source: Compilation outcome:
az: Kompilyasiya nəticəsi:

source: Compilation time:
az: Kompilyasiya vaxtı:

source: Memory used:
az: Yaddaş işledildi:

source: Standard output
az: Standart nəticə

source: Standard error
az: Standart səhv

source: None
az: Heç biri

source: Download
az: Yüklə

source: Played
az: İcrada

source: Play!
az: İcra et!

source: Wait...
az: Gözlə...

source: No tokens
az: Açar yoxdur

source: %(name)s (%(short_name)s) <small>description</small>
az: %(name)s (%(short_name)s) <small>təsvir</small>

source: no statement available
az: şərt verilməyib

source: Download task statement
az: Tapşiriq şərtlərini yüklə

source: The statement for this task is available in multiple versions, in different languages.
az: Bu tapşırıq üçün şərt müxtətlif versiyalarda və müxtəlif dillərdə mövcuddur.

source: You can see (and download) all of them using the list on the right.
az: Sağdakı siyahıdan onlari istifadə edə (yukləyə) bilərsiniz.

source: Some suggested translations follow.
az: Bəzi teklif edilmiş tərcumeləri izlə.

source: Statement in <b>%(lang)s</b>
az: <b>%(lang)s</b> də şərh

source: Statement in %(lang)s
az: %(lang)s də şərt

source: Some details
az: Bəzi məqamlar

source: Compilation commands
az: Kompilyasiya əmrləri

source: Remember that to see the detailed result of a submission you need to use both a contest-token and a task-token.
az: Nəzərə alın ki, siz ətraflı nəticələr üçün həm contest-token,

source: Attachments
az: Yüklənənlər

source: %(name)s (%(short_name)s) <small>submissions</small>
az: %(name)s (%(short_name)s) <small>göndərilmiş həllər</small>

source: Submit a solution
az: Həlli təqdim et

source: You can submit %(submissions_left)s more solution(s).
az: Siz daha %(submissions_left)s həll yollaya edə bilərsiniz.

source: Previous submissions
az: Əvvelki həllər

source: Right now, you have infinite tokens available on this task.
az: Hal-hazırda sizin bu tapşırıqla bağlı sonsuz sayda açarlarınız vardır.

source: Right now, you have one token available on this task.
az: Hal-hazırda sizin bu tapşırıqla bağlı bir açarınız var.

source: Right now, you have %(tokens)s tokens available on this task.
az: Hal-hazırda sizin bu tapşırıqla bağlı %(tokens)s açarınız var.

source: But you have to wait until %(expiration_time)s to use them.
az: Lakin siz onları %(expiration_time)s qədər istifadə edə bilərsiniz.

source: You will receive a new token at %(gen_time)s.
az: Yeni açarı alacağınız vaxt: %(gen_time)s.

source: In the current situation, no more tokens will be generated.
az: Cari vəziyyətde heç bir açar yaradılmayacaq.

source: Right now, you do not have tokens available for this task.
az: Hal hazırda bu tapşırıqda sizin uyğun açar yoxdur.

source: But you will have to wait until %(expiration_time)s to use it.
az: Lakin siz %(expiration_time)s zamanına qədər gözləməlisiniz.

source: Public score
az: İctimai xal

source: Total score
az: Yekun xal

source: Score
az: Xal

source: Official
az: Rəsmi

source: Token
az: Açar

source: no submissions yet
az: həll təqdim olunmayıb

source: Submission details
az: Təqdimat detalları

source: Close
az: Bağla

source: Submit a test
az: Test təqdim et

source: You can submit %(user_tests_left)s more test(s).
az: Siz daha %(user_tests_left)s test yükləyə bilərsiniz.

source: input
az: giriş

source: Previous tests
az: Əvvəlki testlər

source: Input
az: Giriş

source: Output
az: Nəticə

source: no tests yet
az: testlər verilməyib

source: Test details
az: Test təfərrüatları"

source: Evaluation outcome
az: Qiymətləndirmə nəticəsi
